tutorials/modules/multicomponentFluid/verticalChannelLTS/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    inletCentral
    {
        type            zeroGradient;
    }

    inletSides
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
